#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: d693d865b17997aec9745afb188615e6.pdb
; shader hash: d693d865b17997aec9745afb188615e6
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer denoiserData
; {
;
;   struct denoiserData
;   {
;
;       struct struct.DenoiserData
;       {
;
;           float2 textureDim;                        ; Offset:    0
;           float2 invTextureDim;                     ; Offset:    8
;           float kernelSize;                         ; Offset:   16
;           int atrousStepSize;                       ; Offset:   20
;           float temporalFade;                       ; Offset:   24
;       
;       } denoiserData;                               ; Offset:    0
;
;   
;   } denoiserData;                                   ; Offset:    0 Size:    28
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; denoiserData                      cbuffer      NA          NA     CB0            cb0     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !41, globals: !61)
!1 = !DIFile(filename: "..\5C..\5CRun\5CData\5CShaders\5C..\5C..\5CRun\5CData\5CShaders\5CAtrousWaveletFilterCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16, !25, !34}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 124, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 124, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 124, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 124, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 124, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 124, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, size: 64, align: 32, elements: !18, templateParams: !22)
!18 = !{!19, !21}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, baseType: !20, size: 32, align: 32, flags: DIFlagPublic)
!20 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, baseType: !20, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!22 = !{!23, !24}
!23 = !DITemplateTypeParameter(name: "element", type: !20)
!24 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "int3", file: !1, line: 142, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 3>", file: !1, line: 142, size: 96, align: 32, elements: !27, templateParams: !31)
!27 = !{!28, !29, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 142, baseType: !15, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 142, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !26, file: !1, line: 142, baseType: !15, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!32, !33}
!32 = !DITemplateTypeParameter(name: "element", type: !15)
!33 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 23, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 23, size: 96, align: 32, elements: !36, templateParams: !40)
!36 = !{!37, !38, !39}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !35, file: !1, line: 23, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !35, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !35, file: !1, line: 23, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!40 = !{!13, !33}
!41 = !{!42, !46, !50, !54, !57, !58, !59, !60}
!42 = !DISubprogram(name: "main", scope: !43, file: !43, line: 122, type: !44, isLocal: false, isDefinition: true, scopeLine: 123, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!43 = !DIFile(filename: "..\5C..\5CRun\5CData\5CShaders\5CAtrousWaveletFilterCS.hlsl", directory: "")
!44 = !DISubroutineType(types: !45)
!45 = !{null, !16}
!46 = !DISubprogram(name: "Luminance", linkageName: "\01?Luminance@@YAMV?$vector@M$02@@@Z", scope: !47, file: !47, line: 62, type: !48, isLocal: false, isDefinition: true, scopeLine: 63, flags: DIFlagPrototyped, isOptimized: false)
!47 = !DIFile(filename: "..\5C..\5CRun\5CData\5CShaders/MathFunctions.hlsli", directory: "")
!48 = !DISubroutineType(types: !49)
!49 = !{!8, !34}
!50 = !DISubprogram(name: "GetIsWithinDimesions", linkageName: "\01?GetIsWithinDimesions@@YA_NV?$vector@I$01@@0@Z", scope: !47, file: !47, line: 17, type: !51, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: false)
!51 = !DISubroutineType(types: !52)
!52 = !{!53, !16, !16}
!53 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!54 = !DISubprogram(name: "CalculateNormalWeight", linkageName: "\01?CalculateNormalWeight@@YAMV?$vector@I$01@@0@Z", scope: !43, file: !43, line: 50, type: !55, isLocal: false, isDefinition: true, scopeLine: 51, flags: DIFlagPrototyped, isOptimized: false)
!55 = !DISubroutineType(types: !56)
!56 = !{!8, !16, !16}
!57 = !DISubprogram(name: "CalculatePositionWeight", linkageName: "\01?CalculatePositionWeight@@YAMV?$vector@I$01@@0@Z", scope: !43, file: !43, line: 38, type: !55, isLocal: false, isDefinition: true, scopeLine: 39, flags: DIFlagPrototyped, isOptimized: false)
!58 = !DISubprogram(name: "CalculateColorWeight", linkageName: "\01?CalculateColorWeight@@YAMV?$vector@I$01@@0@Z", scope: !43, file: !43, line: 26, type: !55, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: false)
!59 = !DISubprogram(name: "CalculateDepthWeight", linkageName: "\01?CalculateDepthWeight@@YAMV?$vector@I$01@@0@Z", scope: !43, file: !43, line: 73, type: !55, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false)
!60 = !DISubprogram(name: "CalculateVarianceWeight", linkageName: "\01?CalculateVarianceWeight@@YAMV?$vector@I$01@@0@Z", scope: !43, file: !43, line: 98, type: !55, isLocal: false, isDefinition: true, scopeLine: 99, flags: DIFlagPrototyped, isOptimized: false)
!61 = !{!62, !64, !68, !69, !70, !71, !74, !75, !84, !85, !87, !89, !93}
!62 = !DIGlobalVariable(name: "epsVariance", scope: !42, file: !43, line: 141, type: !63, isLocal: true, isDefinition: true)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!64 = !DIGlobalVariable(name: "g_DIInput", linkageName: "\01?g_DIInput@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !43, line: 4, type: !65, isLocal: false, isDefinition: true)
!65 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 4, size: 160, align: 32, elements: !2, templateParams: !66)
!66 = !{!67}
!67 = !DITemplateTypeParameter(name: "element", type: !5)
!68 = !DIGlobalVariable(name: "g_AlbedoInput", linkageName: "\01?g_AlbedoInput@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !43, line: 5, type: !65, isLocal: false, isDefinition: true)
!69 = !DIGlobalVariable(name: "g_NormalInput", linkageName: "\01?g_NormalInput@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !43, line: 6, type: !65, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?g_NormalInput@@3V?$Texture2D@V?$vector@M$03@@@@A")
!70 = !DIGlobalVariable(name: "g_VertexPositionInput", linkageName: "\01?g_VertexPositionInput@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !43, line: 7, type: !65, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?g_VertexPositionInput@@3V?$Texture2D@V?$vector@M$03@@@@A")
!71 = !DIGlobalVariable(name: "g_DepthInput", linkageName: "\01?g_DepthInput@@3V?$Texture2D@M@@A", scope: !0, file: !43, line: 8, type: !72, isLocal: false, isDefinition: true, variable: %"class.Texture2D<float>"* @"\01?g_DepthInput@@3V?$Texture2D@M@@A")
!72 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<float>", file: !1, line: 8, size: 64, align: 32, elements: !2, templateParams: !73)
!73 = !{!13}
!74 = !DIGlobalVariable(name: "g_varianceInput", linkageName: "\01?g_varianceInput@@3V?$Texture2D@M@@A", scope: !0, file: !43, line: 9, type: !72, isLocal: false, isDefinition: true, variable: %"class.Texture2D<float>"* @"\01?g_varianceInput@@3V?$Texture2D@M@@A")
!75 = !DIGlobalVariable(name: "g_PartialDepth", linkageName: "\01?g_PartialDepth@@3V?$Texture2D@V?$vector@M$01@@@@A", scope: !0, file: !43, line: 10, type: !76, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 2> >"* @"\01?g_PartialDepth@@3V?$Texture2D@V?$vector@M$01@@@@A")
!76 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 2> >", file: !1, line: 10, size: 96, align: 32, elements: !2, templateParams: !77)
!77 = !{!78}
!78 = !DITemplateTypeParameter(name: "element", type: !79)
!79 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 10, size: 64, align: 32, elements: !80, templateParams: !83)
!80 = !{!81, !82}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !79, file: !1, line: 10, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !79, file: !1, line: 10, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!83 = !{!13, !24}
!84 = !DIGlobalVariable(name: "g_DenoiserInput", linkageName: "\01?g_DenoiserInput@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !43, line: 11, type: !65, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?g_DenoiserInput@@3V?$Texture2D@V?$vector@M$03@@@@A")
!85 = !DIGlobalVariable(name: "g_output", linkageName: "\01?g_output@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !43, line: 13, type: !86, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?g_output@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!86 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 13, size: 128, align: 32, elements: !2, templateParams: !66)
!87 = !DIGlobalVariable(name: "SimpleSampler", linkageName: "\01?SimpleSampler@@3USamplerState@@A", scope: !0, file: !43, line: 17, type: !88, isLocal: false, isDefinition: true)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 17, size: 32, align: 32, elements: !2)
!89 = !DIGlobalVariable(name: "AtrousFilterKernel", scope: !0, file: !43, line: 18, type: !90, isLocal: true, isDefinition: true, variable: [5 x float]* @AtrousFilterKernel)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 160, align: 32, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 5)
!93 = !DIGlobalVariable(name: "kernelWeights", scope: !0, file: !43, line: 23, type: !94, isLocal: true, isDefinition: true, variable: [3 x float]* @kernelWeights)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 96, align: 32, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 3)
!97 = !{i32 2, !"Dwarf Version", i32 4}
!98 = !{i32 2, !"Debug Info Version", i32 3}
!99 = !{!"dxc 1.2"}
